compose/app/views/teachers/_form.html.erb

SELECT "subjects".* FROM "subjects"
---
    <%= form.label :subject_id, :class => "btn btn-warning btn-sm"%>
    <%= form.collection_select :subject_id, Subject.all, :id, :nazwa, {}, { class: "form-control" } %>