compose/app/controllers/students_controller.rb

def index
  @students = Student.all
---
SELECT "students".* FROM "students" WHERE (imie LIKE '%Tak%' OR nazwisko LIKE '%Tak%' OR klasa LIKE '%Tak%') ORDER BY created_at DESC

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("imie", "nazwisko", "pesel", "klasa", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["imie", "Robert"], ["nazwisko", "Mateja"], ["pesel", "77110594832"], ["klasa", "3d"], ["created_at", "2018-03-10 10:06:08.033083"], ["updated_at", "2018-03-10 10:06:08.033083"]]

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "imie" = ?, "nazwisko" = ?, "pesel" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["imie", "Jan"], ["nazwisko", "Nowak"], ["pesel", "95123112345"], ["updated_at", "2018-03-10 14:54:24.414936"], ["id", 20]]