compose/app/controllers/subjects_controller.rb

SELECT "subjects".* FROM "subjects" WHERE (nazwa LIKE '%his%' OR opis LIKE '%his%' ) ORDER BY created_at DESC
---
def index
  @subjects = Subject.all

INSERT INTO "subjects" ("nazwa", "opis", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nazwa", "polski"], ["opis", "jezyk polski"], ["created_at", "2018-05-12 11:51:42.210501"], ["updated_at", "2018-05-12 11:51:42.210501"]]
---
  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save

DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 4]]
---
  def destroy
    @subject.destroy

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_subject
      @subject = Subject.find(params[:id])