compose/app/controllers/teachers_controller.rb

def index
  @teachers = Teacher.all
---
SELECT "teachers".* FROM "teachers" WHERE (imie LIKE '%janusz%' OR nazwisko LIKE '%janusz%') ORDER BY created_at DESC

  def create
    @teacher = Teacher.new(teacher_params)

    respond_to do |format|
      if @teacher.save
---
INSERT INTO "teachers" ("imie", "nazwisko", "pesel", "subject_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["imie", "Adam"], ["nazwisko", "Nauczycielski"], ["pesel", "63020765432"], ["subject_id", 1], ["created_at", "2018-05-12 20:10:54.563250"], ["updated_at", "2018-05-12 20:10:54.563250"]]

  def update
    respond_to do |format|
      if @teacher.update(teacher_params)
---
UPDATE "teachers" SET "nazwisko" = ?, "updated_at" = ? WHERE "teachers"."id" = ?  [["nazwisko", "Nowotna"], ["updated_at", "2018-05-15 14:16:55.600647"], ["id", 4]]

    def set_teacher
      @teacher = Teacher.find(params[:id])
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]